In [1]:
from sqlalchemy import create_engine, text
import pandas as pd

In [2]:
conn_str = "postgresql+psycopg2://postgres:1234@localhost:5432/module09"
engine = create_engine(conn_str)

In [3]:
# 1.List the employee number, last name, first name, sex, and salary of each employee.
query1 = f"""
SELECT 
	employees.emp_no AS "Employee Number",
	employees.last_name AS "Last Name",
	employees.first_name AS "First Name",
	employees.sex AS "Sex",
	salaries.salary AS "Salary"
FROM 
	employees,
	salaries
WHERE 
	employees.emp_no = salaries.emp_no
--LIMIT 
--	10
;
"""

with engine.connect() as conn:
    result_query1 = pd.read_sql(text(query1), conn)

In [4]:
print(result_query1)

        Employee Number    Last Name First Name Sex  Salary
0                 10001      Facello     Georgi   M   60117
1                 10005     Maliniak    Kyoichi   M   78228
2                 10010     Piveteau  Duangkaew   F   72488
3                 10011        Sluis       Mary   F   42365
4                 10013       Terkki  Eberhardt   M   40000
...                 ...          ...        ...  ..     ...
300019           499967       Bodoff   Bangqing   M   87170
300020           499972       Leuchs     Katsuo   F   41002
300021           499985  Lukaszewicz       Gila   M   40000
300022           499987       Dusink      Rimli   F   52282
300023           499998      Breugel   Patricia   M   40000

[300024 rows x 5 columns]

In [5]:
# 2.List the first name, last name, and hire date for the employees who were hired in 1986.
query2 = f"""
SELECT 
	first_name AS "First Name",
	last_name AS "Last Name",
	hire_date AS "Hire Date"
FROM 
	employees
WHERE 
	extract(year from hire_date) = 1986
--LIMIT 
--	10
;
"""

with engine.connect() as conn:
    result_query2 = pd.read_sql(text(query2), conn)

In [6]:
print(result_query2)

      First Name    Last Name   Hire Date
0           Eran     Cusworth  1986-11-14
1          Bojan     Zallocco  1986-10-14
2          Nevio       Demizu  1986-05-18
3           Ziva       Vecchi  1986-07-03
4          Mohit        Speek  1986-01-14
...          ...          ...         ...
36145      Uriel     Heijenga  1986-06-30
36146      Ziyad  Constantine  1986-02-28
36147     Yishay   Maksimenko  1986-01-27
36148     Yannik        Ranai  1986-04-06
36149     Chenyi     Orlowska  1986-12-25

[36150 rows x 3 columns]

In [7]:
# 3. List the manager of each department along with their department number, department name, 
# employee number, last name, and first name.
query3 = f"""
SELECT 
	dept_manager.emp_no AS "Department Manager",
	dept_manager.dept_no AS "Department Number",
	departments.dept_name AS "Department Name",
	employees.emp_no AS "Employee Number",
	employees.last_name AS "Last Name",
	employees.first_name AS "First Name"
FROM 
	dept_manager, 
	departments,
	employees
WHERE 
	(dept_manager.emp_no = employees.emp_no) 
	AND
	(dept_manager.dept_no = departments.dept_no)
--LIMIT 
--	10
;
"""

with engine.connect() as conn:
    result_query3 = pd.read_sql(text(query3), conn)

In [8]:
print(result_query3)

    Department Manager Department Number     Department Name  Employee Number  \
0               110022              d001           Marketing           110022
1               110039              d001           Marketing           110039
2               110085              d002             Finance           110085
3               110114              d002             Finance           110114
4               110183              d003     Human Resources           110183
5               110228              d003     Human Resources           110228
6               110303              d004          Production           110303
7               110344              d004          Production           110344
8               110386              d004          Production           110386
9               110420              d004          Production           110420
10              110511              d005         Development           110511
11              110567              d005         Development           110567
12              110725              d006  Quality Management           110725
13              110765              d006  Quality Management           110765
14              110800              d006  Quality Management           110800
15              110854              d006  Quality Management           110854
16              111035              d007               Sales           111035
17              111133              d007               Sales           111133
18              111400              d008            Research           111400
19              111534              d008            Research           111534
20              111692              d009    Customer Service           111692
21              111784              d009    Customer Service           111784
22              111877              d009    Customer Service           111877
23              111939              d009    Customer Service           111939

       Last Name   First Name
0     Markovitch    Margareta
1       Minakawa     Vishwani
2          Alpin         Ebru
3     Legleitner        Isamu
4   Ossenbruggen      Shirish
5        Sigstam      Karsten
6        Wegerle    Krassimir
7          Cools       Rosine
8         Kieras         Shem
9       Ghazalie        Oscar
10      Hagimont     DeForest
11      DasSarma         Leon
12       Onuegbe    Peternela
13       Hofmeyr       Rutger
14       Quadeer       Sanjoy
15         Pesch         Dung
16     Kaelbling  Przemyslawa
17         Zhang        Hauke
18       Staelin         Arie
19        Kambil       Hilary
20   Butterworth        Tonny
21    Giarratana        Marjo
22      Spinelli      Xiaobin
23       Weedman      Yuchang

In [9]:
# 4. List the department number for each employee along with that employeeâ€™s employee number, 
# last name, first name, and department name.
query4 = f"""
SELECT 
	dept_emp.dept_no AS "Department Number",
	dept_emp.emp_no AS "Employee Number",
	employees.last_name AS "Last Name",
	employees.first_name AS "First Name",
	departments.dept_name AS "Department Name"
FROM 
	dept_emp, 
	employees, 
	departments
WHERE 
	(dept_emp.emp_no = employees.emp_no) 
	AND
	(dept_emp.dept_no = departments.dept_no)
;
"""

with engine.connect() as conn:
    result_query4 = pd.read_sql(text(query4), conn)

In [10]:
print(result_query4)

       Department Number  Employee Number    Last Name First Name  \
0                   d005            10001      Facello     Georgi
1                   d003            10005     Maliniak    Kyoichi
2                   d004            10010     Piveteau  Duangkaew
3                   d006            10010     Piveteau  Duangkaew
4                   d009            10011        Sluis       Mary
...                  ...              ...          ...        ...
331598              d007           499967       Bodoff   Bangqing
331599              d005           499972       Leuchs     Katsuo
331600              d008           499985  Lukaszewicz       Gila
331601              d007           499987       Dusink      Rimli
331602              d002           499998      Breugel   Patricia

           Department Name
0              Development
1          Human Resources
2               Production
3       Quality Management
4         Customer Service
...                    ...
331598               Sales
331599         Development
331600            Research
331601               Sales
331602             Finance

[331603 rows x 5 columns]

In [11]:
# 5. List first name, last name, and sex of each employee whose first name is Hercules 
# and whose last name begins with the letter B.
query5 = f"""
SELECT 
	first_name AS "First Name",
	last_name AS "Last Name",
	sex AS "Sex"
FROM 
	employees 
WHERE
	(employees.first_name = 'Hercules')
    AND
    (employees.last_name LIKE 'B%')
;
"""


with engine.connect() as conn:
    result_query5 = pd.read_sql(text(query5), conn)

In [12]:
print(result_query5)

   First Name      Last Name Sex
0    Hercules           Baer   M
1    Hercules          Biron   F
2    Hercules          Birge   F
3    Hercules        Berstel   F
4    Hercules      Bernatsky   M
5    Hercules           Bail   F
6    Hercules         Bodoff   M
7    Hercules       Benantar   F
8    Hercules        Basagni   M
9    Hercules  Bernardinello   F
10   Hercules     Baranowski   M
11   Hercules        Bisiani   F
12   Hercules     Benzmuller   M
13   Hercules           Bahr   M
14   Hercules          Biran   F
15   Hercules           Bain   F
16   Hercules        Brendel   F
17   Hercules        Buchter   M
18   Hercules       Barreiro   M
19   Hercules           Baak   M

In [13]:
# 6. List each employee in the Sales department, including their employee number, 
# last name, and first name.

query6 = f"""
SELECT 
	dept_emp.emp_no AS "Employee Number",
	employees.last_name AS "Last Name",
	employees.first_name AS "First Name"
FROM 
	dept_emp, 
	employees, 
	departments
WHERE 
	(dept_emp.dept_no = 'd007') 
	AND
	(dept_emp.dept_no = departments.dept_no) 
	AND
	(dept_emp.emp_no = employees.emp_no)
;
"""

with engine.connect() as conn:
    result_query6 = pd.read_sql(text(query6), conn)

In [14]:
print(result_query6)

       Employee Number   Last Name   First Name
0               246449  Bultermann        Subbu
1               205246      Demizu        Nevio
2               476443      Asmuth         Ziya
3               424270   Yoshizawa       Kellyn
4               280408        Perl      Elliott
...                ...         ...          ...
52240           268515  Maksimenko       Yishay
52241            99439     Manders       Mahmut
52242           464231     Eastman  Constantino
52243            76671    Plessier       Ortrud
52244           264920    Samarati        Percy

[52245 rows x 3 columns]

In [15]:
# 7. List each employee in the Sales and Development departments, including their 
# employee number, last name, first name, and department name.
query7 = f"""
SELECT 
	dept_emp.emp_no AS "Employee Number",
	employees.last_name AS "Last Name",
	employees.first_name AS "First Name",
	departments.dept_name AS "Department Name"
FROM 
	dept_emp, 
	employees, 
	departments
WHERE 
	(dept_emp.dept_no = 'd005' 
	OR
	dept_emp.dept_no = 'd007')
	AND
	dept_emp.dept_no = departments.dept_no 
	AND
	dept_emp.emp_no = employees.emp_no 
;
"""

with engine.connect() as conn:
    result_query7 = pd.read_sql(text(query7), conn)

In [16]:
print(result_query7)

        Employee Number   Last Name   First Name Department Name
0                208153        Lunn      Abdulah     Development
1                 13616       Lorho        Perry     Development
2                246449  Bultermann        Subbu           Sales
3                 21529    Zallocco        Bojan     Development
4                 17934    Wuwongse     Bilhanan     Development
...                 ...         ...          ...             ...
137947            99439     Manders       Mahmut           Sales
137948           229498     Molberg       Jagoda     Development
137949           464231     Eastman  Constantino           Sales
137950            76671    Plessier       Ortrud           Sales
137951           264920    Samarati        Percy           Sales

[137952 rows x 4 columns]

In [17]:
# 8. List the frequency counts, in descending order, of all the employee last names 
# (that is, how many employees share each last name).
query8 = f"""
SELECT 
	last_name AS "Last Name",
	COUNT(last_name) AS "Last Name Count"
FROM 
	employees
GROUP BY 
	last_name
ORDER BY 
	"Last Name Count" DESC 
;
"""

with engine.connect() as conn:
    result_query8 = pd.read_sql(text(query8), conn)

In [18]:
print(result_query8)

       Last Name  Last Name Count
0           Baba              226
1          Coorg              223
2         Gelosh              223
3         Farris              222
4        Sudbeck              222
...          ...              ...
1633   Georgatos              148
1634  Guardalben              148
1635       Merro              147
1636    Sadowsky              145
1637    Foolsday                1

[1638 rows x 2 columns]